# CreateFromCenterline Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartRouteEnd..::..CreateFromCenterline Method
FabricationPartRouteEnd Class See Also
---
Create fabrication routing end from centerline point on straight element.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static FabricationPartRouteEnd CreateFromCenterline(
	Element element,
	XYZ ptAt
)
```

Visual Basic
---
```text
Public Shared Function CreateFromCenterline ( _
	element As Element, _
	ptAt As XYZ _
) As FabricationPartRouteEnd
```

Visual C++
---
```text
public:
static FabricationPartRouteEnd^ CreateFromCenterline(
	Element^ element,
	XYZ^ ptAt
)
```

# ### Parameters
element
    Type: Autodesk.Revit.DB..::..Element The straight element that the centerline is on.
ptAt
    Type: Autodesk.Revit.DB..::..XYZ A point along the straight element where the fitting to be cut in should be positioned.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace